dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief AC, Read Data and Bit Flip Register 38 */
#define MTU_MC0_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610ACu)

/** \brief AE, Read Data and Bit Flip Register 39 */
#define MTU_MC0_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610AEu)

/** \brief B0, Read Data and Bit Flip Register 40 */
#define MTU_MC0_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610B0u)

/** \brief B2, Read Data and Bit Flip Register 41 */
#define MTU_MC0_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610B2u)

/** \brief B4, Read Data and Bit Flip Register 42 */
#define MTU_MC0_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610B4u)

/** \brief B6, Read Data and Bit Flip Register 43 */
#define MTU_MC0_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610B6u)

/** \brief B8, Read Data and Bit Flip Register 44 */
#define MTU_MC0_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610B8u)

/** \brief BA, Read Data and Bit Flip Register 45 */
#define MTU_MC0_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610BAu)

/** \brief BC, Read Data and Bit Flip Register 46 */
#define MTU_MC0_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610BCu)

/** \brief BE, Read Data and Bit Flip Register 47 */
#define MTU_MC0_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610BEu)

/** \brief C0, Read Data and Bit Flip Register 48 */
#define MTU_MC0_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610C0u)

/** \brief C2, Read Data and Bit Flip Register 49 */
#define MTU_MC0_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610C2u)

/** \brief C4, Read Data and Bit Flip Register 50 */
#define MTU_MC0_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610C4u)

/** \brief C6, Read Data and Bit Flip Register 51 */
#define MTU_MC0_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610C6u)

/** \brief C8, Read Data and Bit Flip Register 52 */
#define MTU_MC0_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610C8u)

/** \brief CA, Read Data and Bit Flip Register 53 */
#define MTU_MC0_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610CAu)

/** \brief CC, Read Data and Bit Flip Register 54 */
#define MTU_MC0_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610CCu)

/** \brief CE, Read Data and Bit Flip Register 55 */
#define MTU_MC0_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610CEu)

/** \brief D0, Read Data and Bit Flip Register 56 */
#define MTU_MC0_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610D0u)

/** \brief D2, Read Data and Bit Flip Register 57 */
#define MTU_MC0_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610D2u)

/** \brief D4, Read Data and Bit Flip Register 58 */
#define MTU_MC0_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610D4u)

/** \brief D6, Read Data and Bit Flip Register 59 */
#define MTU_MC0_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610D6u)

/** \brief D8, Read Data and Bit Flip Register 60 */
#define MTU_MC0_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610D8u)

/** \brief DA, Read Data and Bit Flip Register 61 */
#define MTU_MC0_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610DAu)

/** \brief DC, Read Data and Bit Flip Register 62 */
#define MTU_MC0_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610DCu)

/** \brief DE, Read Data and Bit Flip Register 63 */
#define MTU_MC0_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610DEu)

/** \brief E0, Read Data and Bit Flip Register 64 */
#define MTU_MC0_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610E0u)

/** \brief E2, Read Data and Bit Flip Register 65 */
#define MTU_MC0_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610E2u)

/** \brief E4, Read Data and Bit Flip Register 66 */
#define MTU_MC0_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00610E4u)

/** \brief EE, Alarm Sources Configuration Register */
#define MTU_MC0_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00610EEu)

/** \brief F0, SSH Safety Faults Status Register  */
#define MTU_MC0_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00610F0u)

/** \brief F2, Error Information Register 0 */
#define MTU_MC0_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00610F2u)

/** \brief F4, Error Information Register 1 */
#define MTU_MC0_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00610F4u)

/** \brief F6, Error Information Register 2 */
#define MTU_MC0_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00610F6u)

/** \brief F8, Error Information Register 3 */
#define MTU_MC0_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00610F8u)

/** \brief FA, Error Information Register 4 */
#define MTU_MC0_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00610FAu)

/** \brief 100, Configuration Registers */
#define MTU_MC1_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061100u)

/** \brief 102, Configuration Register 1 */
#define MTU_MC1_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0061102u)

/** \brief 104, MBIST Control Register */
#define MTU_MC1_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0061104u)

/** \brief 106, Status Register */
#define MTU_MC1_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0061106u)

/** \brief 108, Range Register, single address mode */
#define MTU_MC1_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0061108u)

/** \brief 10C, Revision ID Register */
#define MTU_MC1_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006110Cu)

/** \brief 10E, ECC Safety Register */
#define MTU_MC1_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006110Eu)

