dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief E8C, Read Data and Bit Flip Register 22 */
#define MTU_MC14_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E8Cu)

/** \brief E8E, Read Data and Bit Flip Register 23 */
#define MTU_MC14_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E8Eu)

/** \brief E90, Read Data and Bit Flip Register 24 */
#define MTU_MC14_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E90u)

/** \brief E92, Read Data and Bit Flip Register 25 */
#define MTU_MC14_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E92u)

/** \brief E94, Read Data and Bit Flip Register 26 */
#define MTU_MC14_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E94u)

/** \brief E96, Read Data and Bit Flip Register 27 */
#define MTU_MC14_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E96u)

/** \brief E98, Read Data and Bit Flip Register 28 */
#define MTU_MC14_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E98u)

/** \brief E9A, Read Data and Bit Flip Register 29 */
#define MTU_MC14_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E9Au)

/** \brief E9C, Read Data and Bit Flip Register 30 */
#define MTU_MC14_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E9Cu)

/** \brief E9E, Read Data and Bit Flip Register 31 */
#define MTU_MC14_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061E9Eu)

/** \brief EA0, Read Data and Bit Flip Register 32 */
#define MTU_MC14_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EA0u)

/** \brief EA2, Read Data and Bit Flip Register 33 */
#define MTU_MC14_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EA2u)

/** \brief EA4, Read Data and Bit Flip Register 34 */
#define MTU_MC14_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EA4u)

/** \brief EA6, Read Data and Bit Flip Register 35 */
#define MTU_MC14_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EA6u)

/** \brief EA8, Read Data and Bit Flip Register 36 */
#define MTU_MC14_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EA8u)

/** \brief EAA, Read Data and Bit Flip Register 37 */
#define MTU_MC14_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EAAu)

/** \brief EAC, Read Data and Bit Flip Register 38 */
#define MTU_MC14_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EACu)

/** \brief EAE, Read Data and Bit Flip Register 39 */
#define MTU_MC14_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EAEu)

/** \brief EB0, Read Data and Bit Flip Register 40 */
#define MTU_MC14_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EB0u)

/** \brief EB2, Read Data and Bit Flip Register 41 */
#define MTU_MC14_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EB2u)

/** \brief EB4, Read Data and Bit Flip Register 42 */
#define MTU_MC14_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EB4u)

/** \brief EB6, Read Data and Bit Flip Register 43 */
#define MTU_MC14_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EB6u)

/** \brief EB8, Read Data and Bit Flip Register 44 */
#define MTU_MC14_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EB8u)

/** \brief EBA, Read Data and Bit Flip Register 45 */
#define MTU_MC14_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EBAu)

/** \brief EBC, Read Data and Bit Flip Register 46 */
#define MTU_MC14_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EBCu)

/** \brief EBE, Read Data and Bit Flip Register 47 */
#define MTU_MC14_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EBEu)

/** \brief EC0, Read Data and Bit Flip Register 48 */
#define MTU_MC14_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EC0u)

/** \brief EC2, Read Data and Bit Flip Register 49 */
#define MTU_MC14_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EC2u)

/** \brief EC4, Read Data and Bit Flip Register 50 */
#define MTU_MC14_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EC4u)

/** \brief EC6, Read Data and Bit Flip Register 51 */
#define MTU_MC14_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EC6u)

/** \brief EC8, Read Data and Bit Flip Register 52 */
#define MTU_MC14_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EC8u)

/** \brief ECA, Read Data and Bit Flip Register 53 */
#define MTU_MC14_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ECAu)

/** \brief ECC, Read Data and Bit Flip Register 54 */
#define MTU_MC14_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ECCu)

/** \brief ECE, Read Data and Bit Flip Register 55 */
#define MTU_MC14_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ECEu)

/** \brief ED0, Read Data and Bit Flip Register 56 */
#define MTU_MC14_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ED0u)

/** \brief ED2, Read Data and Bit Flip Register 57 */
#define MTU_MC14_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ED2u)

/** \brief ED4, Read Data and Bit Flip Register 58 */
#define MTU_MC14_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ED4u)

/** \brief ED6, Read Data and Bit Flip Register 59 */
#define MTU_MC14_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ED6u)

/** \brief ED8, Read Data and Bit Flip Register 60 */
#define MTU_MC14_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061ED8u)

/** \brief EDA, Read Data and Bit Flip Register 61 */
#define MTU_MC14_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EDAu)

/** \brief EDC, Read Data and Bit Flip Register 62 */
#define MTU_MC14_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EDCu)

/** \brief EDE, Read Data and Bit Flip Register 63 */
#define MTU_MC14_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EDEu)

/** \brief EE0, Read Data and Bit Flip Register 64 */
#define MTU_MC14_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EE0u)

/** \brief EE2, Read Data and Bit Flip Register 65 */
#define MTU_MC14_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EE2u)

/** \brief EE4, Read Data and Bit Flip Register 66 */
#define MTU_MC14_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0061EE4u)

/** \brief EEE, Alarm Sources Configuration Register */
#define MTU_MC14_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0061EEEu)

/** \brief EF0, SSH Safety Faults Status Register  */
#define MTU_MC14_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0061EF0u)

/** \brief EF2, Error Information Register 0 */
#define MTU_MC14_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061EF2u)

/** \brief EF4, Error Information Register 1 */
#define MTU_MC14_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061EF4u)

/** \brief EF6, Error Information Register 2 */
#define MTU_MC14_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061EF6u)

/** \brief EF8, Error Information Register 3 */
#define MTU_MC14_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061EF8u)

/** \brief EFA, Error Information Register 4 */
#define MTU_MC14_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0061EFAu)

/** \brief F00, Configuration Registers */
#define MTU_MC15_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0061F00u)

