dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 1590, Read Data and Bit Flip Register 24 */
#define MTU_MC21_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062590u)

/** \brief 1592, Read Data and Bit Flip Register 25 */
#define MTU_MC21_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062592u)

/** \brief 1594, Read Data and Bit Flip Register 26 */
#define MTU_MC21_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062594u)

/** \brief 1596, Read Data and Bit Flip Register 27 */
#define MTU_MC21_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062596u)

/** \brief 1598, Read Data and Bit Flip Register 28 */
#define MTU_MC21_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062598u)

/** \brief 159A, Read Data and Bit Flip Register 29 */
#define MTU_MC21_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006259Au)

/** \brief 159C, Read Data and Bit Flip Register 30 */
#define MTU_MC21_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006259Cu)

/** \brief 159E, Read Data and Bit Flip Register 31 */
#define MTU_MC21_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006259Eu)

/** \brief 15A0, Read Data and Bit Flip Register 32 */
#define MTU_MC21_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625A0u)

/** \brief 15A2, Read Data and Bit Flip Register 33 */
#define MTU_MC21_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625A2u)

/** \brief 15A4, Read Data and Bit Flip Register 34 */
#define MTU_MC21_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625A4u)

/** \brief 15A6, Read Data and Bit Flip Register 35 */
#define MTU_MC21_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625A6u)

/** \brief 15A8, Read Data and Bit Flip Register 36 */
#define MTU_MC21_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625A8u)

/** \brief 15AA, Read Data and Bit Flip Register 37 */
#define MTU_MC21_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625AAu)

/** \brief 15AC, Read Data and Bit Flip Register 38 */
#define MTU_MC21_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625ACu)

/** \brief 15AE, Read Data and Bit Flip Register 39 */
#define MTU_MC21_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625AEu)

/** \brief 15B0, Read Data and Bit Flip Register 40 */
#define MTU_MC21_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625B0u)

/** \brief 15B2, Read Data and Bit Flip Register 41 */
#define MTU_MC21_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625B2u)

/** \brief 15B4, Read Data and Bit Flip Register 42 */
#define MTU_MC21_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625B4u)

/** \brief 15B6, Read Data and Bit Flip Register 43 */
#define MTU_MC21_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625B6u)

/** \brief 15B8, Read Data and Bit Flip Register 44 */
#define MTU_MC21_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625B8u)

/** \brief 15BA, Read Data and Bit Flip Register 45 */
#define MTU_MC21_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625BAu)

/** \brief 15BC, Read Data and Bit Flip Register 46 */
#define MTU_MC21_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625BCu)

/** \brief 15BE, Read Data and Bit Flip Register 47 */
#define MTU_MC21_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625BEu)

/** \brief 15C0, Read Data and Bit Flip Register 48 */
#define MTU_MC21_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625C0u)

/** \brief 15C2, Read Data and Bit Flip Register 49 */
#define MTU_MC21_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625C2u)

/** \brief 15C4, Read Data and Bit Flip Register 50 */
#define MTU_MC21_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625C4u)

/** \brief 15C6, Read Data and Bit Flip Register 51 */
#define MTU_MC21_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625C6u)

/** \brief 15C8, Read Data and Bit Flip Register 52 */
#define MTU_MC21_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625C8u)

/** \brief 15CA, Read Data and Bit Flip Register 53 */
#define MTU_MC21_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625CAu)

/** \brief 15CC, Read Data and Bit Flip Register 54 */
#define MTU_MC21_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625CCu)

/** \brief 15CE, Read Data and Bit Flip Register 55 */
#define MTU_MC21_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625CEu)

/** \brief 15D0, Read Data and Bit Flip Register 56 */
#define MTU_MC21_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625D0u)

/** \brief 15D2, Read Data and Bit Flip Register 57 */
#define MTU_MC21_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625D2u)

/** \brief 15D4, Read Data and Bit Flip Register 58 */
#define MTU_MC21_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625D4u)

/** \brief 15D6, Read Data and Bit Flip Register 59 */
#define MTU_MC21_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625D6u)

/** \brief 15D8, Read Data and Bit Flip Register 60 */
#define MTU_MC21_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625D8u)

/** \brief 15DA, Read Data and Bit Flip Register 61 */
#define MTU_MC21_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625DAu)

/** \brief 15DC, Read Data and Bit Flip Register 62 */
#define MTU_MC21_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625DCu)

/** \brief 15DE, Read Data and Bit Flip Register 63 */
#define MTU_MC21_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625DEu)

/** \brief 15E0, Read Data and Bit Flip Register 64 */
#define MTU_MC21_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625E0u)

/** \brief 15E2, Read Data and Bit Flip Register 65 */
#define MTU_MC21_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625E2u)

/** \brief 15E4, Read Data and Bit Flip Register 66 */
#define MTU_MC21_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00625E4u)

