dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 15EE, Alarm Sources Configuration Register */
#define MTU_MC21_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00625EEu)

/** \brief 15F0, SSH Safety Faults Status Register  */
#define MTU_MC21_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00625F0u)

/** \brief 15F2, Error Information Register 0 */
#define MTU_MC21_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00625F2u)

/** \brief 15F4, Error Information Register 1 */
#define MTU_MC21_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00625F4u)

/** \brief 15F6, Error Information Register 2 */
#define MTU_MC21_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00625F6u)

/** \brief 15F8, Error Information Register 3 */
#define MTU_MC21_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00625F8u)

/** \brief 15FA, Error Information Register 4 */
#define MTU_MC21_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00625FAu)

/** \brief 1600, Configuration Registers */
#define MTU_MC22_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062600u)

/** \brief 1602, Configuration Register 1 */
#define MTU_MC22_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062602u)

/** \brief 1604, MBIST Control Register */
#define MTU_MC22_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062604u)

/** \brief 1606, Status Register */
#define MTU_MC22_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062606u)

/** \brief 1608, Range Register, single address mode */
#define MTU_MC22_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062608u)

/** \brief 160C, Revision ID Register */
#define MTU_MC22_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006260Cu)

/** \brief 160E, ECC Safety Register */
#define MTU_MC22_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006260Eu)

/** \brief 1610, Memory ECC Detection Register */
#define MTU_MC22_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062610u)

/** \brief 1612, Error Tracking Register 0 */
#define MTU_MC22_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062612u)

/** \brief 1614, Error Tracking Register 1 */
#define MTU_MC22_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062614u)

/** \brief 1616, Error Tracking Register 2 */
#define MTU_MC22_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062616u)

/** \brief 1618, Error Tracking Register 3 */
#define MTU_MC22_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062618u)

/** \brief 161A, Error Tracking Register 4 */
#define MTU_MC22_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006261Au)

/** \brief 1660, Read Data and Bit Flip Register 0 */
#define MTU_MC22_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062660u)

/** \brief 1662, Read Data and Bit Flip Register 1 */
#define MTU_MC22_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062662u)

/** \brief 1664, Read Data and Bit Flip Register 2 */
#define MTU_MC22_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062664u)

/** \brief 1666, Read Data and Bit Flip Register 3 */
#define MTU_MC22_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062666u)

/** \brief 1668, Read Data and Bit Flip Register 4 */
#define MTU_MC22_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062668u)

/** \brief 166A, Read Data and Bit Flip Register 5 */
#define MTU_MC22_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006266Au)

/** \brief 166C, Read Data and Bit Flip Register 6 */
#define MTU_MC22_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006266Cu)

/** \brief 166E, Read Data and Bit Flip Register 7 */
#define MTU_MC22_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006266Eu)

/** \brief 1670, Read Data and Bit Flip Register 8 */
#define MTU_MC22_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062670u)

/** \brief 1672, Read Data and Bit Flip Register 9 */
#define MTU_MC22_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062672u)

/** \brief 1674, Read Data and Bit Flip Register 10 */
#define MTU_MC22_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062674u)

/** \brief 1676, Read Data and Bit Flip Register 11 */
#define MTU_MC22_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062676u)

/** \brief 1678, Read Data and Bit Flip Register 12 */
#define MTU_MC22_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062678u)

/** \brief 167A, Read Data and Bit Flip Register 13 */
#define MTU_MC22_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006267Au)

/** \brief 167C, Read Data and Bit Flip Register 14 */
#define MTU_MC22_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006267Cu)

/** \brief 167E, Read Data and Bit Flip Register 15 */
#define MTU_MC22_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006267Eu)

/** \brief 1680, Read Data and Bit Flip Register 16 */
#define MTU_MC22_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062680u)

/** \brief 1682, Read Data and Bit Flip Register 17 */
#define MTU_MC22_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062682u)

/** \brief 1684, Read Data and Bit Flip Register 18 */
#define MTU_MC22_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062684u)

/** \brief 1686, Read Data and Bit Flip Register 19 */
#define MTU_MC22_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062686u)

/** \brief 1688, Read Data and Bit Flip Register 20 */
#define MTU_MC22_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062688u)

/** \brief 168A, Read Data and Bit Flip Register 21 */
#define MTU_MC22_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006268Au)

/** \brief 168C, Read Data and Bit Flip Register 22 */
#define MTU_MC22_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006268Cu)

/** \brief 168E, Read Data and Bit Flip Register 23 */
#define MTU_MC22_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006268Eu)

/** \brief 1690, Read Data and Bit Flip Register 24 */
#define MTU_MC22_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062690u)

/** \brief 1692, Read Data and Bit Flip Register 25 */
#define MTU_MC22_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062692u)

/** \brief 1694, Read Data and Bit Flip Register 26 */
#define MTU_MC22_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062694u)

/** \brief 1696, Read Data and Bit Flip Register 27 */
#define MTU_MC22_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062696u)

