dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 19B8, Read Data and Bit Flip Register 44 */
#define MTU_MC25_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629B8u)

/** \brief 19BA, Read Data and Bit Flip Register 45 */
#define MTU_MC25_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629BAu)

/** \brief 19BC, Read Data and Bit Flip Register 46 */
#define MTU_MC25_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629BCu)

/** \brief 19BE, Read Data and Bit Flip Register 47 */
#define MTU_MC25_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629BEu)

/** \brief 19C0, Read Data and Bit Flip Register 48 */
#define MTU_MC25_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629C0u)

/** \brief 19C2, Read Data and Bit Flip Register 49 */
#define MTU_MC25_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629C2u)

/** \brief 19C4, Read Data and Bit Flip Register 50 */
#define MTU_MC25_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629C4u)

/** \brief 19C6, Read Data and Bit Flip Register 51 */
#define MTU_MC25_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629C6u)

/** \brief 19C8, Read Data and Bit Flip Register 52 */
#define MTU_MC25_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629C8u)

/** \brief 19CA, Read Data and Bit Flip Register 53 */
#define MTU_MC25_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629CAu)

/** \brief 19CC, Read Data and Bit Flip Register 54 */
#define MTU_MC25_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629CCu)

/** \brief 19CE, Read Data and Bit Flip Register 55 */
#define MTU_MC25_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629CEu)

/** \brief 19D0, Read Data and Bit Flip Register 56 */
#define MTU_MC25_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629D0u)

/** \brief 19D2, Read Data and Bit Flip Register 57 */
#define MTU_MC25_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629D2u)

/** \brief 19D4, Read Data and Bit Flip Register 58 */
#define MTU_MC25_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629D4u)

/** \brief 19D6, Read Data and Bit Flip Register 59 */
#define MTU_MC25_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629D6u)

/** \brief 19D8, Read Data and Bit Flip Register 60 */
#define MTU_MC25_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629D8u)

/** \brief 19DA, Read Data and Bit Flip Register 61 */
#define MTU_MC25_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629DAu)

/** \brief 19DC, Read Data and Bit Flip Register 62 */
#define MTU_MC25_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629DCu)

/** \brief 19DE, Read Data and Bit Flip Register 63 */
#define MTU_MC25_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629DEu)

/** \brief 19E0, Read Data and Bit Flip Register 64 */
#define MTU_MC25_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629E0u)

/** \brief 19E2, Read Data and Bit Flip Register 65 */
#define MTU_MC25_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629E2u)

/** \brief 19E4, Read Data and Bit Flip Register 66 */
#define MTU_MC25_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00629E4u)

/** \brief 19EE, Alarm Sources Configuration Register */
#define MTU_MC25_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00629EEu)

/** \brief 19F0, SSH Safety Faults Status Register  */
#define MTU_MC25_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00629F0u)

/** \brief 19F2, Error Information Register 0 */
#define MTU_MC25_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00629F2u)

/** \brief 19F4, Error Information Register 1 */
#define MTU_MC25_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00629F4u)

/** \brief 19F6, Error Information Register 2 */
#define MTU_MC25_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00629F6u)

/** \brief 19F8, Error Information Register 3 */
#define MTU_MC25_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00629F8u)

/** \brief 19FA, Error Information Register 4 */
#define MTU_MC25_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00629FAu)

/** \brief 1A00, Configuration Registers */
#define MTU_MC26_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062A00u)

/** \brief 1A02, Configuration Register 1 */
#define MTU_MC26_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062A02u)

/** \brief 1A04, MBIST Control Register */
#define MTU_MC26_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062A04u)

/** \brief 1A06, Status Register */
#define MTU_MC26_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062A06u)

/** \brief 1A08, Range Register, single address mode */
#define MTU_MC26_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062A08u)

/** \brief 1A0C, Revision ID Register */
#define MTU_MC26_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0062A0Cu)

/** \brief 1A0E, ECC Safety Register */
#define MTU_MC26_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0062A0Eu)

/** \brief 1A10, Memory ECC Detection Register */
#define MTU_MC26_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062A10u)

/** \brief 1A12, Error Tracking Register 0 */
#define MTU_MC26_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062A12u)

/** \brief 1A14, Error Tracking Register 1 */
#define MTU_MC26_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062A14u)

/** \brief 1A16, Error Tracking Register 2 */
#define MTU_MC26_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062A16u)

/** \brief 1A18, Error Tracking Register 3 */
#define MTU_MC26_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062A18u)

/** \brief 1A1A, Error Tracking Register 4 */
#define MTU_MC26_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062A1Au)

