dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 1DB4, Read Data and Bit Flip Register 42 */
#define MTU_MC29_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DB4u)

/** \brief 1DB6, Read Data and Bit Flip Register 43 */
#define MTU_MC29_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DB6u)

/** \brief 1DB8, Read Data and Bit Flip Register 44 */
#define MTU_MC29_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DB8u)

/** \brief 1DBA, Read Data and Bit Flip Register 45 */
#define MTU_MC29_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DBAu)

/** \brief 1DBC, Read Data and Bit Flip Register 46 */
#define MTU_MC29_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DBCu)

/** \brief 1DBE, Read Data and Bit Flip Register 47 */
#define MTU_MC29_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DBEu)

/** \brief 1DC0, Read Data and Bit Flip Register 48 */
#define MTU_MC29_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DC0u)

/** \brief 1DC2, Read Data and Bit Flip Register 49 */
#define MTU_MC29_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DC2u)

/** \brief 1DC4, Read Data and Bit Flip Register 50 */
#define MTU_MC29_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DC4u)

/** \brief 1DC6, Read Data and Bit Flip Register 51 */
#define MTU_MC29_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DC6u)

/** \brief 1DC8, Read Data and Bit Flip Register 52 */
#define MTU_MC29_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DC8u)

/** \brief 1DCA, Read Data and Bit Flip Register 53 */
#define MTU_MC29_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DCAu)

/** \brief 1DCC, Read Data and Bit Flip Register 54 */
#define MTU_MC29_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DCCu)

/** \brief 1DCE, Read Data and Bit Flip Register 55 */
#define MTU_MC29_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DCEu)

/** \brief 1DD0, Read Data and Bit Flip Register 56 */
#define MTU_MC29_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DD0u)

/** \brief 1DD2, Read Data and Bit Flip Register 57 */
#define MTU_MC29_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DD2u)

/** \brief 1DD4, Read Data and Bit Flip Register 58 */
#define MTU_MC29_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DD4u)

/** \brief 1DD6, Read Data and Bit Flip Register 59 */
#define MTU_MC29_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DD6u)

/** \brief 1DD8, Read Data and Bit Flip Register 60 */
#define MTU_MC29_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DD8u)

/** \brief 1DDA, Read Data and Bit Flip Register 61 */
#define MTU_MC29_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DDAu)

/** \brief 1DDC, Read Data and Bit Flip Register 62 */
#define MTU_MC29_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DDCu)

/** \brief 1DDE, Read Data and Bit Flip Register 63 */
#define MTU_MC29_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DDEu)

/** \brief 1DE0, Read Data and Bit Flip Register 64 */
#define MTU_MC29_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DE0u)

/** \brief 1DE2, Read Data and Bit Flip Register 65 */
#define MTU_MC29_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DE2u)

/** \brief 1DE4, Read Data and Bit Flip Register 66 */
#define MTU_MC29_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062DE4u)

/** \brief 1DEE, Alarm Sources Configuration Register */
#define MTU_MC29_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0062DEEu)

/** \brief 1DF0, SSH Safety Faults Status Register  */
#define MTU_MC29_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0062DF0u)

/** \brief 1DF2, Error Information Register 0 */
#define MTU_MC29_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062DF2u)

/** \brief 1DF4, Error Information Register 1 */
#define MTU_MC29_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062DF4u)

/** \brief 1DF6, Error Information Register 2 */
#define MTU_MC29_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062DF6u)

/** \brief 1DF8, Error Information Register 3 */
#define MTU_MC29_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062DF8u)

/** \brief 1DFA, Error Information Register 4 */
#define MTU_MC29_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062DFAu)

/** \brief 1E00, Configuration Registers */
#define MTU_MC30_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062E00u)

/** \brief 1E02, Configuration Register 1 */
#define MTU_MC30_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062E02u)

/** \brief 1E04, MBIST Control Register */
#define MTU_MC30_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062E04u)

/** \brief 1E06, Status Register */
#define MTU_MC30_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062E06u)

/** \brief 1E08, Range Register, single address mode */
#define MTU_MC30_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062E08u)

/** \brief 1E0C, Revision ID Register */
#define MTU_MC30_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0062E0Cu)

/** \brief 1E0E, ECC Safety Register */
#define MTU_MC30_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0062E0Eu)

/** \brief 1E10, Memory ECC Detection Register */
#define MTU_MC30_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062E10u)

/** \brief 1E12, Error Tracking Register 0 */
#define MTU_MC30_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062E12u)

/** \brief 1E14, Error Tracking Register 1 */
#define MTU_MC30_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062E14u)

/** \brief 1E16, Error Tracking Register 2 */
#define MTU_MC30_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062E16u)

/** \brief 1E18, Error Tracking Register 3 */
#define MTU_MC30_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062E18u)

/** \brief 1E1A, Error Tracking Register 4 */
#define MTU_MC30_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062E1Au)

/** \brief 1E60, Read Data and Bit Flip Register 0 */
#define MTU_MC30_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E60u)

/** \brief 1E62, Read Data and Bit Flip Register 1 */
#define MTU_MC30_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062E62u)

