dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 1EB6, Read Data and Bit Flip Register 43 */
#define MTU_MC30_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EB6u)

/** \brief 1EB8, Read Data and Bit Flip Register 44 */
#define MTU_MC30_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EB8u)

/** \brief 1EBA, Read Data and Bit Flip Register 45 */
#define MTU_MC30_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EBAu)

/** \brief 1EBC, Read Data and Bit Flip Register 46 */
#define MTU_MC30_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EBCu)

/** \brief 1EBE, Read Data and Bit Flip Register 47 */
#define MTU_MC30_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EBEu)

/** \brief 1EC0, Read Data and Bit Flip Register 48 */
#define MTU_MC30_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EC0u)

/** \brief 1EC2, Read Data and Bit Flip Register 49 */
#define MTU_MC30_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EC2u)

/** \brief 1EC4, Read Data and Bit Flip Register 50 */
#define MTU_MC30_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EC4u)

/** \brief 1EC6, Read Data and Bit Flip Register 51 */
#define MTU_MC30_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EC6u)

/** \brief 1EC8, Read Data and Bit Flip Register 52 */
#define MTU_MC30_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EC8u)

/** \brief 1ECA, Read Data and Bit Flip Register 53 */
#define MTU_MC30_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ECAu)

/** \brief 1ECC, Read Data and Bit Flip Register 54 */
#define MTU_MC30_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ECCu)

/** \brief 1ECE, Read Data and Bit Flip Register 55 */
#define MTU_MC30_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ECEu)

/** \brief 1ED0, Read Data and Bit Flip Register 56 */
#define MTU_MC30_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ED0u)

/** \brief 1ED2, Read Data and Bit Flip Register 57 */
#define MTU_MC30_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ED2u)

/** \brief 1ED4, Read Data and Bit Flip Register 58 */
#define MTU_MC30_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ED4u)

/** \brief 1ED6, Read Data and Bit Flip Register 59 */
#define MTU_MC30_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ED6u)

/** \brief 1ED8, Read Data and Bit Flip Register 60 */
#define MTU_MC30_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062ED8u)

/** \brief 1EDA, Read Data and Bit Flip Register 61 */
#define MTU_MC30_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EDAu)

/** \brief 1EDC, Read Data and Bit Flip Register 62 */
#define MTU_MC30_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EDCu)

/** \brief 1EDE, Read Data and Bit Flip Register 63 */
#define MTU_MC30_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EDEu)

/** \brief 1EE0, Read Data and Bit Flip Register 64 */
#define MTU_MC30_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EE0u)

/** \brief 1EE2, Read Data and Bit Flip Register 65 */
#define MTU_MC30_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EE2u)

/** \brief 1EE4, Read Data and Bit Flip Register 66 */
#define MTU_MC30_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0062EE4u)

/** \brief 1EEE, Alarm Sources Configuration Register */
#define MTU_MC30_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0062EEEu)

/** \brief 1EF0, SSH Safety Faults Status Register  */
#define MTU_MC30_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0062EF0u)

/** \brief 1EF2, Error Information Register 0 */
#define MTU_MC30_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062EF2u)

/** \brief 1EF4, Error Information Register 1 */
#define MTU_MC30_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062EF4u)

/** \brief 1EF6, Error Information Register 2 */
#define MTU_MC30_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062EF6u)

/** \brief 1EF8, Error Information Register 3 */
#define MTU_MC30_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062EF8u)

/** \brief 1EFA, Error Information Register 4 */
#define MTU_MC30_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0062EFAu)

/** \brief 1F00, Configuration Registers */
#define MTU_MC31_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0062F00u)

/** \brief 1F02, Configuration Register 1 */
#define MTU_MC31_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0062F02u)

/** \brief 1F04, MBIST Control Register */
#define MTU_MC31_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0062F04u)

/** \brief 1F06, Status Register */
#define MTU_MC31_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0062F06u)

/** \brief 1F08, Range Register, single address mode */
#define MTU_MC31_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0062F08u)

/** \brief 1F0C, Revision ID Register */
#define MTU_MC31_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0062F0Cu)

/** \brief 1F0E, ECC Safety Register */
#define MTU_MC31_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0062F0Eu)

/** \brief 1F10, Memory ECC Detection Register */
#define MTU_MC31_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0062F10u)

/** \brief 1F12, Error Tracking Register 0 */
#define MTU_MC31_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062F12u)

/** \brief 1F14, Error Tracking Register 1 */
#define MTU_MC31_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062F14u)

/** \brief 1F16, Error Tracking Register 2 */
#define MTU_MC31_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062F16u)

/** \brief 1F18, Error Tracking Register 3 */
#define MTU_MC31_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0062F18u)

