dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 25C8, Read Data and Bit Flip Register 52 */
#define MTU_MC37_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635C8u)

/** \brief 25CA, Read Data and Bit Flip Register 53 */
#define MTU_MC37_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635CAu)

/** \brief 25CC, Read Data and Bit Flip Register 54 */
#define MTU_MC37_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635CCu)

/** \brief 25CE, Read Data and Bit Flip Register 55 */
#define MTU_MC37_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635CEu)

/** \brief 25D0, Read Data and Bit Flip Register 56 */
#define MTU_MC37_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635D0u)

/** \brief 25D2, Read Data and Bit Flip Register 57 */
#define MTU_MC37_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635D2u)

/** \brief 25D4, Read Data and Bit Flip Register 58 */
#define MTU_MC37_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635D4u)

/** \brief 25D6, Read Data and Bit Flip Register 59 */
#define MTU_MC37_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635D6u)

/** \brief 25D8, Read Data and Bit Flip Register 60 */
#define MTU_MC37_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635D8u)

/** \brief 25DA, Read Data and Bit Flip Register 61 */
#define MTU_MC37_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635DAu)

/** \brief 25DC, Read Data and Bit Flip Register 62 */
#define MTU_MC37_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635DCu)

/** \brief 25DE, Read Data and Bit Flip Register 63 */
#define MTU_MC37_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635DEu)

/** \brief 25E0, Read Data and Bit Flip Register 64 */
#define MTU_MC37_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635E0u)

/** \brief 25E2, Read Data and Bit Flip Register 65 */
#define MTU_MC37_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635E2u)

/** \brief 25E4, Read Data and Bit Flip Register 66 */
#define MTU_MC37_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00635E4u)

/** \brief 25EE, Alarm Sources Configuration Register */
#define MTU_MC37_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00635EEu)

/** \brief 25F0, SSH Safety Faults Status Register  */
#define MTU_MC37_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00635F0u)

/** \brief 25F2, Error Information Register 0 */
#define MTU_MC37_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00635F2u)

/** \brief 25F4, Error Information Register 1 */
#define MTU_MC37_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00635F4u)

/** \brief 25F6, Error Information Register 2 */
#define MTU_MC37_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00635F6u)

/** \brief 25F8, Error Information Register 3 */
#define MTU_MC37_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00635F8u)

/** \brief 25FA, Error Information Register 4 */
#define MTU_MC37_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00635FAu)

/** \brief 2600, Configuration Registers */
#define MTU_MC38_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063600u)

/** \brief 2602, Configuration Register 1 */
#define MTU_MC38_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063602u)

/** \brief 2604, MBIST Control Register */
#define MTU_MC38_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063604u)

/** \brief 2606, Status Register */
#define MTU_MC38_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063606u)

/** \brief 2608, Range Register, single address mode */
#define MTU_MC38_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063608u)

/** \brief 260C, Revision ID Register */
#define MTU_MC38_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006360Cu)

/** \brief 260E, ECC Safety Register */
#define MTU_MC38_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006360Eu)

/** \brief 2610, Memory ECC Detection Register */
#define MTU_MC38_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063610u)

/** \brief 2612, Error Tracking Register 0 */
#define MTU_MC38_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063612u)

/** \brief 2614, Error Tracking Register 1 */
#define MTU_MC38_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063614u)

/** \brief 2616, Error Tracking Register 2 */
#define MTU_MC38_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063616u)

/** \brief 2618, Error Tracking Register 3 */
#define MTU_MC38_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063618u)

/** \brief 261A, Error Tracking Register 4 */
#define MTU_MC38_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006361Au)

/** \brief 2660, Read Data and Bit Flip Register 0 */
#define MTU_MC38_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063660u)

/** \brief 2662, Read Data and Bit Flip Register 1 */
#define MTU_MC38_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063662u)

/** \brief 2664, Read Data and Bit Flip Register 2 */
#define MTU_MC38_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063664u)

/** \brief 2666, Read Data and Bit Flip Register 3 */
#define MTU_MC38_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063666u)

/** \brief 2668, Read Data and Bit Flip Register 4 */
#define MTU_MC38_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063668u)

/** \brief 266A, Read Data and Bit Flip Register 5 */
#define MTU_MC38_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006366Au)

/** \brief 266C, Read Data and Bit Flip Register 6 */
#define MTU_MC38_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006366Cu)

/** \brief 266E, Read Data and Bit Flip Register 7 */
#define MTU_MC38_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006366Eu)

/** \brief 2670, Read Data and Bit Flip Register 8 */
#define MTU_MC38_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063670u)

/** \brief 2672, Read Data and Bit Flip Register 9 */
#define MTU_MC38_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063672u)

/** \brief 2674, Read Data and Bit Flip Register 10 */
#define MTU_MC38_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063674u)

/** \brief 2676, Read Data and Bit Flip Register 11 */
#define MTU_MC38_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063676u)

