dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 2A02, Configuration Register 1 */
#define MTU_MC42_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063A02u)

/** \brief 2A04, MBIST Control Register */
#define MTU_MC42_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063A04u)

/** \brief 2A06, Status Register */
#define MTU_MC42_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063A06u)

/** \brief 2A08, Range Register, single address mode */
#define MTU_MC42_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063A08u)

/** \brief 2A0C, Revision ID Register */
#define MTU_MC42_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063A0Cu)

/** \brief 2A0E, ECC Safety Register */
#define MTU_MC42_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063A0Eu)

/** \brief 2A10, Memory ECC Detection Register */
#define MTU_MC42_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063A10u)

/** \brief 2A12, Error Tracking Register 0 */
#define MTU_MC42_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063A12u)

/** \brief 2A14, Error Tracking Register 1 */
#define MTU_MC42_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063A14u)

/** \brief 2A16, Error Tracking Register 2 */
#define MTU_MC42_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063A16u)

/** \brief 2A18, Error Tracking Register 3 */
#define MTU_MC42_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063A18u)

/** \brief 2A1A, Error Tracking Register 4 */
#define MTU_MC42_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063A1Au)

/** \brief 2A60, Read Data and Bit Flip Register 0 */
#define MTU_MC42_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A60u)

/** \brief 2A62, Read Data and Bit Flip Register 1 */
#define MTU_MC42_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A62u)

/** \brief 2A64, Read Data and Bit Flip Register 2 */
#define MTU_MC42_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A64u)

/** \brief 2A66, Read Data and Bit Flip Register 3 */
#define MTU_MC42_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A66u)

/** \brief 2A68, Read Data and Bit Flip Register 4 */
#define MTU_MC42_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A68u)

/** \brief 2A6A, Read Data and Bit Flip Register 5 */
#define MTU_MC42_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A6Au)

/** \brief 2A6C, Read Data and Bit Flip Register 6 */
#define MTU_MC42_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A6Cu)

/** \brief 2A6E, Read Data and Bit Flip Register 7 */
#define MTU_MC42_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A6Eu)

/** \brief 2A70, Read Data and Bit Flip Register 8 */
#define MTU_MC42_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A70u)

/** \brief 2A72, Read Data and Bit Flip Register 9 */
#define MTU_MC42_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A72u)

/** \brief 2A74, Read Data and Bit Flip Register 10 */
#define MTU_MC42_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A74u)

/** \brief 2A76, Read Data and Bit Flip Register 11 */
#define MTU_MC42_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A76u)

/** \brief 2A78, Read Data and Bit Flip Register 12 */
#define MTU_MC42_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A78u)

/** \brief 2A7A, Read Data and Bit Flip Register 13 */
#define MTU_MC42_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A7Au)

/** \brief 2A7C, Read Data and Bit Flip Register 14 */
#define MTU_MC42_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A7Cu)

/** \brief 2A7E, Read Data and Bit Flip Register 15 */
#define MTU_MC42_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A7Eu)

/** \brief 2A80, Read Data and Bit Flip Register 16 */
#define MTU_MC42_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A80u)

/** \brief 2A82, Read Data and Bit Flip Register 17 */
#define MTU_MC42_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A82u)

/** \brief 2A84, Read Data and Bit Flip Register 18 */
#define MTU_MC42_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A84u)

/** \brief 2A86, Read Data and Bit Flip Register 19 */
#define MTU_MC42_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A86u)

/** \brief 2A88, Read Data and Bit Flip Register 20 */
#define MTU_MC42_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A88u)

/** \brief 2A8A, Read Data and Bit Flip Register 21 */
#define MTU_MC42_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A8Au)

/** \brief 2A8C, Read Data and Bit Flip Register 22 */
#define MTU_MC42_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A8Cu)

/** \brief 2A8E, Read Data and Bit Flip Register 23 */
#define MTU_MC42_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A8Eu)

/** \brief 2A90, Read Data and Bit Flip Register 24 */
#define MTU_MC42_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A90u)

/** \brief 2A92, Read Data and Bit Flip Register 25 */
#define MTU_MC42_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A92u)

/** \brief 2A94, Read Data and Bit Flip Register 26 */
#define MTU_MC42_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A94u)

/** \brief 2A96, Read Data and Bit Flip Register 27 */
#define MTU_MC42_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A96u)

/** \brief 2A98, Read Data and Bit Flip Register 28 */
#define MTU_MC42_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A98u)

/** \brief 2A9A, Read Data and Bit Flip Register 29 */
#define MTU_MC42_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A9Au)

/** \brief 2A9C, Read Data and Bit Flip Register 30 */
#define MTU_MC42_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A9Cu)

/** \brief 2A9E, Read Data and Bit Flip Register 31 */
#define MTU_MC42_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063A9Eu)

/** \brief 2AA0, Read Data and Bit Flip Register 32 */
#define MTU_MC42_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AA0u)

/** \brief 2AA2, Read Data and Bit Flip Register 33 */
#define MTU_MC42_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AA2u)

/** \brief 2AA4, Read Data and Bit Flip Register 34 */
#define MTU_MC42_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063AA4u)

