dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 2ECC, Read Data and Bit Flip Register 54 */
#define MTU_MC46_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ECCu)

/** \brief 2ECE, Read Data and Bit Flip Register 55 */
#define MTU_MC46_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ECEu)

/** \brief 2ED0, Read Data and Bit Flip Register 56 */
#define MTU_MC46_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ED0u)

/** \brief 2ED2, Read Data and Bit Flip Register 57 */
#define MTU_MC46_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ED2u)

/** \brief 2ED4, Read Data and Bit Flip Register 58 */
#define MTU_MC46_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ED4u)

/** \brief 2ED6, Read Data and Bit Flip Register 59 */
#define MTU_MC46_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ED6u)

/** \brief 2ED8, Read Data and Bit Flip Register 60 */
#define MTU_MC46_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063ED8u)

/** \brief 2EDA, Read Data and Bit Flip Register 61 */
#define MTU_MC46_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EDAu)

/** \brief 2EDC, Read Data and Bit Flip Register 62 */
#define MTU_MC46_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EDCu)

/** \brief 2EDE, Read Data and Bit Flip Register 63 */
#define MTU_MC46_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EDEu)

/** \brief 2EE0, Read Data and Bit Flip Register 64 */
#define MTU_MC46_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EE0u)

/** \brief 2EE2, Read Data and Bit Flip Register 65 */
#define MTU_MC46_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EE2u)

/** \brief 2EE4, Read Data and Bit Flip Register 66 */
#define MTU_MC46_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063EE4u)

/** \brief 2EEE, Alarm Sources Configuration Register */
#define MTU_MC46_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0063EEEu)

/** \brief 2EF0, SSH Safety Faults Status Register  */
#define MTU_MC46_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0063EF0u)

/** \brief 2EF2, Error Information Register 0 */
#define MTU_MC46_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063EF2u)

/** \brief 2EF4, Error Information Register 1 */
#define MTU_MC46_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063EF4u)

/** \brief 2EF6, Error Information Register 2 */
#define MTU_MC46_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063EF6u)

/** \brief 2EF8, Error Information Register 3 */
#define MTU_MC46_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063EF8u)

/** \brief 2EFA, Error Information Register 4 */
#define MTU_MC46_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0063EFAu)

/** \brief 2F00, Configuration Registers */
#define MTU_MC47_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0063F00u)

/** \brief 2F02, Configuration Register 1 */
#define MTU_MC47_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0063F02u)

/** \brief 2F04, MBIST Control Register */
#define MTU_MC47_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0063F04u)

/** \brief 2F06, Status Register */
#define MTU_MC47_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0063F06u)

/** \brief 2F08, Range Register, single address mode */
#define MTU_MC47_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0063F08u)

/** \brief 2F0C, Revision ID Register */
#define MTU_MC47_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0063F0Cu)

/** \brief 2F0E, ECC Safety Register */
#define MTU_MC47_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0063F0Eu)

/** \brief 2F10, Memory ECC Detection Register */
#define MTU_MC47_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0063F10u)

/** \brief 2F12, Error Tracking Register 0 */
#define MTU_MC47_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063F12u)

/** \brief 2F14, Error Tracking Register 1 */
#define MTU_MC47_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063F14u)

/** \brief 2F16, Error Tracking Register 2 */
#define MTU_MC47_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063F16u)

/** \brief 2F18, Error Tracking Register 3 */
#define MTU_MC47_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063F18u)

/** \brief 2F1A, Error Tracking Register 4 */
#define MTU_MC47_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0063F1Au)

/** \brief 2F60, Read Data and Bit Flip Register 0 */
#define MTU_MC47_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F60u)

/** \brief 2F62, Read Data and Bit Flip Register 1 */
#define MTU_MC47_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F62u)

/** \brief 2F64, Read Data and Bit Flip Register 2 */
#define MTU_MC47_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F64u)

/** \brief 2F66, Read Data and Bit Flip Register 3 */
#define MTU_MC47_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F66u)

/** \brief 2F68, Read Data and Bit Flip Register 4 */
#define MTU_MC47_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F68u)

/** \brief 2F6A, Read Data and Bit Flip Register 5 */
#define MTU_MC47_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F6Au)

/** \brief 2F6C, Read Data and Bit Flip Register 6 */
#define MTU_MC47_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F6Cu)

/** \brief 2F6E, Read Data and Bit Flip Register 7 */
#define MTU_MC47_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F6Eu)

/** \brief 2F70, Read Data and Bit Flip Register 8 */
#define MTU_MC47_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0063F70u)

