dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 35F0, SSH Safety Faults Status Register  */
#define MTU_MC53_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00645F0u)

/** \brief 35F2, Error Information Register 0 */
#define MTU_MC53_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00645F2u)

/** \brief 35F4, Error Information Register 1 */
#define MTU_MC53_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00645F4u)

/** \brief 35F6, Error Information Register 2 */
#define MTU_MC53_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00645F6u)

/** \brief 35F8, Error Information Register 3 */
#define MTU_MC53_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00645F8u)

/** \brief 35FA, Error Information Register 4 */
#define MTU_MC53_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00645FAu)

/** \brief 3600, Configuration Registers */
#define MTU_MC54_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0064600u)

/** \brief 3602, Configuration Register 1 */
#define MTU_MC54_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0064602u)

/** \brief 3604, MBIST Control Register */
#define MTU_MC54_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0064604u)

/** \brief 3606, Status Register */
#define MTU_MC54_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0064606u)

/** \brief 3608, Range Register, single address mode */
#define MTU_MC54_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0064608u)

/** \brief 360C, Revision ID Register */
#define MTU_MC54_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006460Cu)

/** \brief 360E, ECC Safety Register */
#define MTU_MC54_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006460Eu)

/** \brief 3610, Memory ECC Detection Register */
#define MTU_MC54_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0064610u)

/** \brief 3612, Error Tracking Register 0 */
#define MTU_MC54_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064612u)

/** \brief 3614, Error Tracking Register 1 */
#define MTU_MC54_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064614u)

/** \brief 3616, Error Tracking Register 2 */
#define MTU_MC54_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064616u)

/** \brief 3618, Error Tracking Register 3 */
#define MTU_MC54_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0064618u)

/** \brief 361A, Error Tracking Register 4 */
#define MTU_MC54_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006461Au)

/** \brief 3660, Read Data and Bit Flip Register 0 */
#define MTU_MC54_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064660u)

/** \brief 3662, Read Data and Bit Flip Register 1 */
#define MTU_MC54_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064662u)

/** \brief 3664, Read Data and Bit Flip Register 2 */
#define MTU_MC54_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064664u)

/** \brief 3666, Read Data and Bit Flip Register 3 */
#define MTU_MC54_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064666u)

/** \brief 3668, Read Data and Bit Flip Register 4 */
#define MTU_MC54_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064668u)

/** \brief 366A, Read Data and Bit Flip Register 5 */
#define MTU_MC54_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006466Au)

/** \brief 366C, Read Data and Bit Flip Register 6 */
#define MTU_MC54_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006466Cu)

/** \brief 366E, Read Data and Bit Flip Register 7 */
#define MTU_MC54_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006466Eu)

/** \brief 3670, Read Data and Bit Flip Register 8 */
#define MTU_MC54_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064670u)

/** \brief 3672, Read Data and Bit Flip Register 9 */
#define MTU_MC54_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064672u)

/** \brief 3674, Read Data and Bit Flip Register 10 */
#define MTU_MC54_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064674u)

/** \brief 3676, Read Data and Bit Flip Register 11 */
#define MTU_MC54_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064676u)

/** \brief 3678, Read Data and Bit Flip Register 12 */
#define MTU_MC54_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064678u)

/** \brief 367A, Read Data and Bit Flip Register 13 */
#define MTU_MC54_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006467Au)

/** \brief 367C, Read Data and Bit Flip Register 14 */
#define MTU_MC54_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006467Cu)

/** \brief 367E, Read Data and Bit Flip Register 15 */
#define MTU_MC54_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006467Eu)

/** \brief 3680, Read Data and Bit Flip Register 16 */
#define MTU_MC54_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064680u)

/** \brief 3682, Read Data and Bit Flip Register 17 */
#define MTU_MC54_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064682u)

/** \brief 3684, Read Data and Bit Flip Register 18 */
#define MTU_MC54_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064684u)

/** \brief 3686, Read Data and Bit Flip Register 19 */
#define MTU_MC54_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064686u)

/** \brief 3688, Read Data and Bit Flip Register 20 */
#define MTU_MC54_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0064688u)

/** \brief 368A, Read Data and Bit Flip Register 21 */
#define MTU_MC54_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006468Au)

/** \brief 368C, Read Data and Bit Flip Register 22 */
#define MTU_MC54_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006468Cu)

