dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 4618, Error Tracking Register 3 */
#define MTU_MC70_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065618u)

/** \brief 461A, Error Tracking Register 4 */
#define MTU_MC70_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF006561Au)

/** \brief 4660, Read Data and Bit Flip Register 0 */
#define MTU_MC70_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065660u)

/** \brief 4662, Read Data and Bit Flip Register 1 */
#define MTU_MC70_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065662u)

/** \brief 4664, Read Data and Bit Flip Register 2 */
#define MTU_MC70_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065664u)

/** \brief 4666, Read Data and Bit Flip Register 3 */
#define MTU_MC70_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065666u)

/** \brief 4668, Read Data and Bit Flip Register 4 */
#define MTU_MC70_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065668u)

/** \brief 466A, Read Data and Bit Flip Register 5 */
#define MTU_MC70_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006566Au)

/** \brief 466C, Read Data and Bit Flip Register 6 */
#define MTU_MC70_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006566Cu)

/** \brief 466E, Read Data and Bit Flip Register 7 */
#define MTU_MC70_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006566Eu)

/** \brief 4670, Read Data and Bit Flip Register 8 */
#define MTU_MC70_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065670u)

/** \brief 4672, Read Data and Bit Flip Register 9 */
#define MTU_MC70_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065672u)

/** \brief 4674, Read Data and Bit Flip Register 10 */
#define MTU_MC70_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065674u)

/** \brief 4676, Read Data and Bit Flip Register 11 */
#define MTU_MC70_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065676u)

/** \brief 4678, Read Data and Bit Flip Register 12 */
#define MTU_MC70_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065678u)

/** \brief 467A, Read Data and Bit Flip Register 13 */
#define MTU_MC70_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006567Au)

/** \brief 467C, Read Data and Bit Flip Register 14 */
#define MTU_MC70_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006567Cu)

/** \brief 467E, Read Data and Bit Flip Register 15 */
#define MTU_MC70_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006567Eu)

/** \brief 4680, Read Data and Bit Flip Register 16 */
#define MTU_MC70_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065680u)

/** \brief 4682, Read Data and Bit Flip Register 17 */
#define MTU_MC70_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065682u)

/** \brief 4684, Read Data and Bit Flip Register 18 */
#define MTU_MC70_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065684u)

/** \brief 4686, Read Data and Bit Flip Register 19 */
#define MTU_MC70_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065686u)

/** \brief 4688, Read Data and Bit Flip Register 20 */
#define MTU_MC70_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065688u)

/** \brief 468A, Read Data and Bit Flip Register 21 */
#define MTU_MC70_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006568Au)

/** \brief 468C, Read Data and Bit Flip Register 22 */
#define MTU_MC70_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006568Cu)

/** \brief 468E, Read Data and Bit Flip Register 23 */
#define MTU_MC70_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006568Eu)

/** \brief 4690, Read Data and Bit Flip Register 24 */
#define MTU_MC70_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065690u)

/** \brief 4692, Read Data and Bit Flip Register 25 */
#define MTU_MC70_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065692u)

/** \brief 4694, Read Data and Bit Flip Register 26 */
#define MTU_MC70_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065694u)

/** \brief 4696, Read Data and Bit Flip Register 27 */
#define MTU_MC70_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065696u)

/** \brief 4698, Read Data and Bit Flip Register 28 */
#define MTU_MC70_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065698u)

/** \brief 469A, Read Data and Bit Flip Register 29 */
#define MTU_MC70_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006569Au)

/** \brief 469C, Read Data and Bit Flip Register 30 */
#define MTU_MC70_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006569Cu)

/** \brief 469E, Read Data and Bit Flip Register 31 */
#define MTU_MC70_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006569Eu)

/** \brief 46A0, Read Data and Bit Flip Register 32 */
#define MTU_MC70_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656A0u)

/** \brief 46A2, Read Data and Bit Flip Register 33 */
#define MTU_MC70_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656A2u)

/** \brief 46A4, Read Data and Bit Flip Register 34 */
#define MTU_MC70_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656A4u)

/** \brief 46A6, Read Data and Bit Flip Register 35 */
#define MTU_MC70_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656A6u)

/** \brief 46A8, Read Data and Bit Flip Register 36 */
#define MTU_MC70_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656A8u)

/** \brief 46AA, Read Data and Bit Flip Register 37 */
#define MTU_MC70_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656AAu)

/** \brief 46AC, Read Data and Bit Flip Register 38 */
#define MTU_MC70_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656ACu)

