dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 46AE, Read Data and Bit Flip Register 39 */
#define MTU_MC70_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656AEu)

/** \brief 46B0, Read Data and Bit Flip Register 40 */
#define MTU_MC70_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656B0u)

/** \brief 46B2, Read Data and Bit Flip Register 41 */
#define MTU_MC70_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656B2u)

/** \brief 46B4, Read Data and Bit Flip Register 42 */
#define MTU_MC70_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656B4u)

/** \brief 46B6, Read Data and Bit Flip Register 43 */
#define MTU_MC70_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656B6u)

/** \brief 46B8, Read Data and Bit Flip Register 44 */
#define MTU_MC70_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656B8u)

/** \brief 46BA, Read Data and Bit Flip Register 45 */
#define MTU_MC70_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656BAu)

/** \brief 46BC, Read Data and Bit Flip Register 46 */
#define MTU_MC70_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656BCu)

/** \brief 46BE, Read Data and Bit Flip Register 47 */
#define MTU_MC70_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656BEu)

/** \brief 46C0, Read Data and Bit Flip Register 48 */
#define MTU_MC70_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656C0u)

/** \brief 46C2, Read Data and Bit Flip Register 49 */
#define MTU_MC70_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656C2u)

/** \brief 46C4, Read Data and Bit Flip Register 50 */
#define MTU_MC70_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656C4u)

/** \brief 46C6, Read Data and Bit Flip Register 51 */
#define MTU_MC70_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656C6u)

/** \brief 46C8, Read Data and Bit Flip Register 52 */
#define MTU_MC70_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656C8u)

/** \brief 46CA, Read Data and Bit Flip Register 53 */
#define MTU_MC70_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656CAu)

/** \brief 46CC, Read Data and Bit Flip Register 54 */
#define MTU_MC70_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656CCu)

/** \brief 46CE, Read Data and Bit Flip Register 55 */
#define MTU_MC70_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656CEu)

/** \brief 46D0, Read Data and Bit Flip Register 56 */
#define MTU_MC70_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656D0u)

/** \brief 46D2, Read Data and Bit Flip Register 57 */
#define MTU_MC70_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656D2u)

/** \brief 46D4, Read Data and Bit Flip Register 58 */
#define MTU_MC70_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656D4u)

/** \brief 46D6, Read Data and Bit Flip Register 59 */
#define MTU_MC70_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656D6u)

/** \brief 46D8, Read Data and Bit Flip Register 60 */
#define MTU_MC70_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656D8u)

/** \brief 46DA, Read Data and Bit Flip Register 61 */
#define MTU_MC70_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656DAu)

/** \brief 46DC, Read Data and Bit Flip Register 62 */
#define MTU_MC70_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656DCu)

/** \brief 46DE, Read Data and Bit Flip Register 63 */
#define MTU_MC70_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656DEu)

/** \brief 46E0, Read Data and Bit Flip Register 64 */
#define MTU_MC70_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656E0u)

/** \brief 46E2, Read Data and Bit Flip Register 65 */
#define MTU_MC70_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656E2u)

/** \brief 46E4, Read Data and Bit Flip Register 66 */
#define MTU_MC70_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00656E4u)

/** \brief 46EE, Alarm Sources Configuration Register */
#define MTU_MC70_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF00656EEu)

/** \brief 46F0, SSH Safety Faults Status Register  */
#define MTU_MC70_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF00656F0u)

/** \brief 46F2, Error Information Register 0 */
#define MTU_MC70_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00656F2u)

/** \brief 46F4, Error Information Register 1 */
#define MTU_MC70_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00656F4u)

/** \brief 46F6, Error Information Register 2 */
#define MTU_MC70_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00656F6u)

/** \brief 46F8, Error Information Register 3 */
#define MTU_MC70_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00656F8u)

/** \brief 46FA, Error Information Register 4 */
#define MTU_MC70_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF00656FAu)

/** \brief 4700, Configuration Registers */
#define MTU_MC71_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065700u)

/** \brief 4702, Configuration Register 1 */
#define MTU_MC71_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065702u)

/** \brief 4704, MBIST Control Register */
#define MTU_MC71_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0065704u)

/** \brief 4706, Status Register */
#define MTU_MC71_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0065706u)

/** \brief 4708, Range Register, single address mode */
#define MTU_MC71_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0065708u)

/** \brief 470C, Revision ID Register */
#define MTU_MC71_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF006570Cu)

/** \brief 470E, ECC Safety Register */
#define MTU_MC71_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF006570Eu)

/** \brief 4710, Memory ECC Detection Register */
#define MTU_MC71_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0065710u)

/** \brief 4712, Error Tracking Register 0 */
#define MTU_MC71_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0065712u)

