dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 4A98, Read Data and Bit Flip Register 28 */
#define MTU_MC74_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A98u)

/** \brief 4A9A, Read Data and Bit Flip Register 29 */
#define MTU_MC74_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A9Au)

/** \brief 4A9C, Read Data and Bit Flip Register 30 */
#define MTU_MC74_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A9Cu)

/** \brief 4A9E, Read Data and Bit Flip Register 31 */
#define MTU_MC74_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065A9Eu)

/** \brief 4AA0, Read Data and Bit Flip Register 32 */
#define MTU_MC74_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AA0u)

/** \brief 4AA2, Read Data and Bit Flip Register 33 */
#define MTU_MC74_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AA2u)

/** \brief 4AA4, Read Data and Bit Flip Register 34 */
#define MTU_MC74_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AA4u)

/** \brief 4AA6, Read Data and Bit Flip Register 35 */
#define MTU_MC74_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AA6u)

/** \brief 4AA8, Read Data and Bit Flip Register 36 */
#define MTU_MC74_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AA8u)

/** \brief 4AAA, Read Data and Bit Flip Register 37 */
#define MTU_MC74_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AAAu)

/** \brief 4AAC, Read Data and Bit Flip Register 38 */
#define MTU_MC74_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AACu)

/** \brief 4AAE, Read Data and Bit Flip Register 39 */
#define MTU_MC74_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AAEu)

/** \brief 4AB0, Read Data and Bit Flip Register 40 */
#define MTU_MC74_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AB0u)

/** \brief 4AB2, Read Data and Bit Flip Register 41 */
#define MTU_MC74_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AB2u)

/** \brief 4AB4, Read Data and Bit Flip Register 42 */
#define MTU_MC74_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AB4u)

/** \brief 4AB6, Read Data and Bit Flip Register 43 */
#define MTU_MC74_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AB6u)

/** \brief 4AB8, Read Data and Bit Flip Register 44 */
#define MTU_MC74_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AB8u)

/** \brief 4ABA, Read Data and Bit Flip Register 45 */
#define MTU_MC74_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ABAu)

/** \brief 4ABC, Read Data and Bit Flip Register 46 */
#define MTU_MC74_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ABCu)

/** \brief 4ABE, Read Data and Bit Flip Register 47 */
#define MTU_MC74_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ABEu)

/** \brief 4AC0, Read Data and Bit Flip Register 48 */
#define MTU_MC74_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AC0u)

/** \brief 4AC2, Read Data and Bit Flip Register 49 */
#define MTU_MC74_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AC2u)

/** \brief 4AC4, Read Data and Bit Flip Register 50 */
#define MTU_MC74_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AC4u)

/** \brief 4AC6, Read Data and Bit Flip Register 51 */
#define MTU_MC74_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AC6u)

/** \brief 4AC8, Read Data and Bit Flip Register 52 */
#define MTU_MC74_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AC8u)

/** \brief 4ACA, Read Data and Bit Flip Register 53 */
#define MTU_MC74_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ACAu)

/** \brief 4ACC, Read Data and Bit Flip Register 54 */
#define MTU_MC74_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ACCu)

/** \brief 4ACE, Read Data and Bit Flip Register 55 */
#define MTU_MC74_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ACEu)

/** \brief 4AD0, Read Data and Bit Flip Register 56 */
#define MTU_MC74_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AD0u)

/** \brief 4AD2, Read Data and Bit Flip Register 57 */
#define MTU_MC74_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AD2u)

/** \brief 4AD4, Read Data and Bit Flip Register 58 */
#define MTU_MC74_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AD4u)

/** \brief 4AD6, Read Data and Bit Flip Register 59 */
#define MTU_MC74_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AD6u)

/** \brief 4AD8, Read Data and Bit Flip Register 60 */
#define MTU_MC74_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AD8u)

/** \brief 4ADA, Read Data and Bit Flip Register 61 */
#define MTU_MC74_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ADAu)

/** \brief 4ADC, Read Data and Bit Flip Register 62 */
#define MTU_MC74_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ADCu)

/** \brief 4ADE, Read Data and Bit Flip Register 63 */
#define MTU_MC74_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065ADEu)

/** \brief 4AE0, Read Data and Bit Flip Register 64 */
#define MTU_MC74_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AE0u)

/** \brief 4AE2, Read Data and Bit Flip Register 65 */
#define MTU_MC74_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AE2u)

/** \brief 4AE4, Read Data and Bit Flip Register 66 */
#define MTU_MC74_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0065AE4u)

/** \brief 4AEE, Alarm Sources Configuration Register */
#define MTU_MC74_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0065AEEu)

/** \brief 4AF0, SSH Safety Faults Status Register  */
#define MTU_MC74_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0065AF0u)

/** \brief 4AF2, Error Information Register 0 */
#define MTU_MC74_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065AF2u)

/** \brief 4AF4, Error Information Register 1 */
#define MTU_MC74_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065AF4u)

/** \brief 4AF6, Error Information Register 2 */
#define MTU_MC74_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065AF6u)

/** \brief 4AF8, Error Information Register 3 */
#define MTU_MC74_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065AF8u)

/** \brief 4AFA, Error Information Register 4 */
#define MTU_MC74_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0065AFAu)

/** \brief 4B00, Configuration Registers */
#define MTU_MC75_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0065B00u)

/** \brief 4B02, Configuration Register 1 */
#define MTU_MC75_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0065B02u)

