dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 5574, Read Data and Bit Flip Register 10 */
#define MTU_MC85_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066574u)

/** \brief 5576, Read Data and Bit Flip Register 11 */
#define MTU_MC85_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066576u)

/** \brief 5578, Read Data and Bit Flip Register 12 */
#define MTU_MC85_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066578u)

/** \brief 557A, Read Data and Bit Flip Register 13 */
#define MTU_MC85_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006657Au)

/** \brief 557C, Read Data and Bit Flip Register 14 */
#define MTU_MC85_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006657Cu)

/** \brief 557E, Read Data and Bit Flip Register 15 */
#define MTU_MC85_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006657Eu)

/** \brief 5580, Read Data and Bit Flip Register 16 */
#define MTU_MC85_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066580u)

/** \brief 5582, Read Data and Bit Flip Register 17 */
#define MTU_MC85_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066582u)

/** \brief 5584, Read Data and Bit Flip Register 18 */
#define MTU_MC85_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066584u)

/** \brief 5586, Read Data and Bit Flip Register 19 */
#define MTU_MC85_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066586u)

/** \brief 5588, Read Data and Bit Flip Register 20 */
#define MTU_MC85_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066588u)

/** \brief 558A, Read Data and Bit Flip Register 21 */
#define MTU_MC85_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006658Au)

/** \brief 558C, Read Data and Bit Flip Register 22 */
#define MTU_MC85_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006658Cu)

/** \brief 558E, Read Data and Bit Flip Register 23 */
#define MTU_MC85_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006658Eu)

/** \brief 5590, Read Data and Bit Flip Register 24 */
#define MTU_MC85_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066590u)

/** \brief 5592, Read Data and Bit Flip Register 25 */
#define MTU_MC85_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066592u)

/** \brief 5594, Read Data and Bit Flip Register 26 */
#define MTU_MC85_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066594u)

/** \brief 5596, Read Data and Bit Flip Register 27 */
#define MTU_MC85_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066596u)

/** \brief 5598, Read Data and Bit Flip Register 28 */
#define MTU_MC85_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066598u)

/** \brief 559A, Read Data and Bit Flip Register 29 */
#define MTU_MC85_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006659Au)

/** \brief 559C, Read Data and Bit Flip Register 30 */
#define MTU_MC85_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006659Cu)

/** \brief 559E, Read Data and Bit Flip Register 31 */
#define MTU_MC85_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF006659Eu)

/** \brief 55A0, Read Data and Bit Flip Register 32 */
#define MTU_MC85_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665A0u)

/** \brief 55A2, Read Data and Bit Flip Register 33 */
#define MTU_MC85_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665A2u)

/** \brief 55A4, Read Data and Bit Flip Register 34 */
#define MTU_MC85_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665A4u)

/** \brief 55A6, Read Data and Bit Flip Register 35 */
#define MTU_MC85_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665A6u)

/** \brief 55A8, Read Data and Bit Flip Register 36 */
#define MTU_MC85_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665A8u)

/** \brief 55AA, Read Data and Bit Flip Register 37 */
#define MTU_MC85_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665AAu)

/** \brief 55AC, Read Data and Bit Flip Register 38 */
#define MTU_MC85_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665ACu)

/** \brief 55AE, Read Data and Bit Flip Register 39 */
#define MTU_MC85_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665AEu)

/** \brief 55B0, Read Data and Bit Flip Register 40 */
#define MTU_MC85_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665B0u)

/** \brief 55B2, Read Data and Bit Flip Register 41 */
#define MTU_MC85_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665B2u)

/** \brief 55B4, Read Data and Bit Flip Register 42 */
#define MTU_MC85_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665B4u)

/** \brief 55B6, Read Data and Bit Flip Register 43 */
#define MTU_MC85_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665B6u)

/** \brief 55B8, Read Data and Bit Flip Register 44 */
#define MTU_MC85_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665B8u)

/** \brief 55BA, Read Data and Bit Flip Register 45 */
#define MTU_MC85_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665BAu)

/** \brief 55BC, Read Data and Bit Flip Register 46 */
#define MTU_MC85_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665BCu)

/** \brief 55BE, Read Data and Bit Flip Register 47 */
#define MTU_MC85_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665BEu)

/** \brief 55C0, Read Data and Bit Flip Register 48 */
#define MTU_MC85_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665C0u)

/** \brief 55C2, Read Data and Bit Flip Register 49 */
#define MTU_MC85_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665C2u)

/** \brief 55C4, Read Data and Bit Flip Register 50 */
#define MTU_MC85_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665C4u)

/** \brief 55C6, Read Data and Bit Flip Register 51 */
#define MTU_MC85_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF00665C6u)

