dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 5DC8, Read Data and Bit Flip Register 52 */
#define MTU_MC93_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DC8u)

/** \brief 5DCA, Read Data and Bit Flip Register 53 */
#define MTU_MC93_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DCAu)

/** \brief 5DCC, Read Data and Bit Flip Register 54 */
#define MTU_MC93_RDBFL54 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DCCu)

/** \brief 5DCE, Read Data and Bit Flip Register 55 */
#define MTU_MC93_RDBFL55 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DCEu)

/** \brief 5DD0, Read Data and Bit Flip Register 56 */
#define MTU_MC93_RDBFL56 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DD0u)

/** \brief 5DD2, Read Data and Bit Flip Register 57 */
#define MTU_MC93_RDBFL57 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DD2u)

/** \brief 5DD4, Read Data and Bit Flip Register 58 */
#define MTU_MC93_RDBFL58 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DD4u)

/** \brief 5DD6, Read Data and Bit Flip Register 59 */
#define MTU_MC93_RDBFL59 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DD6u)

/** \brief 5DD8, Read Data and Bit Flip Register 60 */
#define MTU_MC93_RDBFL60 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DD8u)

/** \brief 5DDA, Read Data and Bit Flip Register 61 */
#define MTU_MC93_RDBFL61 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DDAu)

/** \brief 5DDC, Read Data and Bit Flip Register 62 */
#define MTU_MC93_RDBFL62 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DDCu)

/** \brief 5DDE, Read Data and Bit Flip Register 63 */
#define MTU_MC93_RDBFL63 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DDEu)

/** \brief 5DE0, Read Data and Bit Flip Register 64 */
#define MTU_MC93_RDBFL64 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DE0u)

/** \brief 5DE2, Read Data and Bit Flip Register 65 */
#define MTU_MC93_RDBFL65 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DE2u)

/** \brief 5DE4, Read Data and Bit Flip Register 66 */
#define MTU_MC93_RDBFL66 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066DE4u)

/** \brief 5DEE, Alarm Sources Configuration Register */
#define MTU_MC93_ALMSRCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ALMSRCS*)0xF0066DEEu)

/** \brief 5DF0, SSH Safety Faults Status Register  */
#define MTU_MC93_FAULTSTS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_FAULTSTS*)0xF0066DF0u)

/** \brief 5DF2, Error Information Register 0 */
#define MTU_MC93_ERRINFO0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066DF2u)

/** \brief 5DF4, Error Information Register 1 */
#define MTU_MC93_ERRINFO1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066DF4u)

/** \brief 5DF6, Error Information Register 2 */
#define MTU_MC93_ERRINFO2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066DF6u)

/** \brief 5DF8, Error Information Register 3 */
#define MTU_MC93_ERRINFO3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066DF8u)

/** \brief 5DFA, Error Information Register 4 */
#define MTU_MC93_ERRINFO4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ERRINFO*)0xF0066DFAu)

/** \brief 5E00, Configuration Registers */
#define MTU_MC94_CONFIG0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG0*)0xF0066E00u)

/** \brief 5E02, Configuration Register 1 */
#define MTU_MC94_CONFIG1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_CONFIG1*)0xF0066E02u)

/** \brief 5E04, MBIST Control Register */
#define MTU_MC94_MCONTROL /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MCONTROL*)0xF0066E04u)

/** \brief 5E06, Status Register */
#define MTU_MC94_MSTATUS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_MSTATUS*)0xF0066E06u)

/** \brief 5E08, Range Register, single address mode */
#define MTU_MC94_RANGE /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RANGE*)0xF0066E08u)

/** \brief 5E0C, Revision ID Register */
#define MTU_MC94_REVID /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_REVID*)0xF0066E0Cu)

/** \brief 5E0E, ECC Safety Register */
#define MTU_MC94_ECCS /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCS*)0xF0066E0Eu)

/** \brief 5E10, Memory ECC Detection Register */
#define MTU_MC94_ECCD /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ECCD*)0xF0066E10u)

/** \brief 5E12, Error Tracking Register 0 */
#define MTU_MC94_ETRR0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066E12u)

/** \brief 5E14, Error Tracking Register 1 */
#define MTU_MC94_ETRR1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066E14u)

/** \brief 5E16, Error Tracking Register 2 */
#define MTU_MC94_ETRR2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066E16u)

/** \brief 5E18, Error Tracking Register 3 */
#define MTU_MC94_ETRR3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066E18u)

/** \brief 5E1A, Error Tracking Register 4 */
#define MTU_MC94_ETRR4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_ETRR*)0xF0066E1Au)

/** \brief 5E60, Read Data and Bit Flip Register 0 */
#define MTU_MC94_RDBFL0 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E60u)

/** \brief 5E62, Read Data and Bit Flip Register 1 */
#define MTU_MC94_RDBFL1 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E62u)

/** \brief 5E64, Read Data and Bit Flip Register 2 */
#define MTU_MC94_RDBFL2 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E64u)

/** \brief 5E66, Read Data and Bit Flip Register 3 */
#define MTU_MC94_RDBFL3 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E66u)

/** \brief 5E68, Read Data and Bit Flip Register 4 */
#define MTU_MC94_RDBFL4 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E68u)

/** \brief 5E6A, Read Data and Bit Flip Register 5 */
#define MTU_MC94_RDBFL5 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E6Au)

/** \brief 5E6C, Read Data and Bit Flip Register 6 */
#define MTU_MC94_RDBFL6 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E6Cu)

/** \brief 5E6E, Read Data and Bit Flip Register 7 */
#define MTU_MC94_RDBFL7 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E6Eu)

/** \brief 5E70, Read Data and Bit Flip Register 8 */
#define MTU_MC94_RDBFL8 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E70u)

/** \brief 5E72, Read Data and Bit Flip Register 9 */
#define MTU_MC94_RDBFL9 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E72u)

/** \brief 5E74, Read Data and Bit Flip Register 10 */
#define MTU_MC94_RDBFL10 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E74u)

