dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/IfxMtu_reg.h
/** \brief 5E76, Read Data and Bit Flip Register 11 */
#define MTU_MC94_RDBFL11 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E76u)

/** \brief 5E78, Read Data and Bit Flip Register 12 */
#define MTU_MC94_RDBFL12 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E78u)

/** \brief 5E7A, Read Data and Bit Flip Register 13 */
#define MTU_MC94_RDBFL13 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E7Au)

/** \brief 5E7C, Read Data and Bit Flip Register 14 */
#define MTU_MC94_RDBFL14 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E7Cu)

/** \brief 5E7E, Read Data and Bit Flip Register 15 */
#define MTU_MC94_RDBFL15 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E7Eu)

/** \brief 5E80, Read Data and Bit Flip Register 16 */
#define MTU_MC94_RDBFL16 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E80u)

/** \brief 5E82, Read Data and Bit Flip Register 17 */
#define MTU_MC94_RDBFL17 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E82u)

/** \brief 5E84, Read Data and Bit Flip Register 18 */
#define MTU_MC94_RDBFL18 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E84u)

/** \brief 5E86, Read Data and Bit Flip Register 19 */
#define MTU_MC94_RDBFL19 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E86u)

/** \brief 5E88, Read Data and Bit Flip Register 20 */
#define MTU_MC94_RDBFL20 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E88u)

/** \brief 5E8A, Read Data and Bit Flip Register 21 */
#define MTU_MC94_RDBFL21 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E8Au)

/** \brief 5E8C, Read Data and Bit Flip Register 22 */
#define MTU_MC94_RDBFL22 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E8Cu)

/** \brief 5E8E, Read Data and Bit Flip Register 23 */
#define MTU_MC94_RDBFL23 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E8Eu)

/** \brief 5E90, Read Data and Bit Flip Register 24 */
#define MTU_MC94_RDBFL24 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E90u)

/** \brief 5E92, Read Data and Bit Flip Register 25 */
#define MTU_MC94_RDBFL25 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E92u)

/** \brief 5E94, Read Data and Bit Flip Register 26 */
#define MTU_MC94_RDBFL26 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E94u)

/** \brief 5E96, Read Data and Bit Flip Register 27 */
#define MTU_MC94_RDBFL27 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E96u)

/** \brief 5E98, Read Data and Bit Flip Register 28 */
#define MTU_MC94_RDBFL28 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E98u)

/** \brief 5E9A, Read Data and Bit Flip Register 29 */
#define MTU_MC94_RDBFL29 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E9Au)

/** \brief 5E9C, Read Data and Bit Flip Register 30 */
#define MTU_MC94_RDBFL30 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E9Cu)

/** \brief 5E9E, Read Data and Bit Flip Register 31 */
#define MTU_MC94_RDBFL31 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066E9Eu)

/** \brief 5EA0, Read Data and Bit Flip Register 32 */
#define MTU_MC94_RDBFL32 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EA0u)

/** \brief 5EA2, Read Data and Bit Flip Register 33 */
#define MTU_MC94_RDBFL33 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EA2u)

/** \brief 5EA4, Read Data and Bit Flip Register 34 */
#define MTU_MC94_RDBFL34 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EA4u)

/** \brief 5EA6, Read Data and Bit Flip Register 35 */
#define MTU_MC94_RDBFL35 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EA6u)

/** \brief 5EA8, Read Data and Bit Flip Register 36 */
#define MTU_MC94_RDBFL36 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EA8u)

/** \brief 5EAA, Read Data and Bit Flip Register 37 */
#define MTU_MC94_RDBFL37 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EAAu)

/** \brief 5EAC, Read Data and Bit Flip Register 38 */
#define MTU_MC94_RDBFL38 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EACu)

/** \brief 5EAE, Read Data and Bit Flip Register 39 */
#define MTU_MC94_RDBFL39 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EAEu)

/** \brief 5EB0, Read Data and Bit Flip Register 40 */
#define MTU_MC94_RDBFL40 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EB0u)

/** \brief 5EB2, Read Data and Bit Flip Register 41 */
#define MTU_MC94_RDBFL41 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EB2u)

/** \brief 5EB4, Read Data and Bit Flip Register 42 */
#define MTU_MC94_RDBFL42 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EB4u)

/** \brief 5EB6, Read Data and Bit Flip Register 43 */
#define MTU_MC94_RDBFL43 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EB6u)

/** \brief 5EB8, Read Data and Bit Flip Register 44 */
#define MTU_MC94_RDBFL44 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EB8u)

/** \brief 5EBA, Read Data and Bit Flip Register 45 */
#define MTU_MC94_RDBFL45 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EBAu)

/** \brief 5EBC, Read Data and Bit Flip Register 46 */
#define MTU_MC94_RDBFL46 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EBCu)

/** \brief 5EBE, Read Data and Bit Flip Register 47 */
#define MTU_MC94_RDBFL47 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EBEu)

/** \brief 5EC0, Read Data and Bit Flip Register 48 */
#define MTU_MC94_RDBFL48 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EC0u)

/** \brief 5EC2, Read Data and Bit Flip Register 49 */
#define MTU_MC94_RDBFL49 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EC2u)

/** \brief 5EC4, Read Data and Bit Flip Register 50 */
#define MTU_MC94_RDBFL50 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EC4u)

/** \brief 5EC6, Read Data and Bit Flip Register 51 */
#define MTU_MC94_RDBFL51 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EC6u)

/** \brief 5EC8, Read Data and Bit Flip Register 52 */
#define MTU_MC94_RDBFL52 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066EC8u)

/** \brief 5ECA, Read Data and Bit Flip Register 53 */
#define MTU_MC94_RDBFL53 /*lint --e(923, 9078)*/ (*(volatile Ifx_MTU_MC_RDBFL*)0xF0066ECAu)

